/*  Class = "NSButton"; gToolTip = "Delete selected favorite (⌫)"; ObjectID = "17";  */
"Delete selected favorite (⌫)" = "Effacer le favori sélectionné (⌫)";

/*  Class = "NSButton"; gToolTip = "Add favorite (⌥⌘A)"; ObjectID = "18";  */
"Add favorite (⌥⌘A)" = "Ajouter un favori (⌥⌘A)";

/*  Class = "NSTableColumn"; headerCell.title = "Favorites"; ObjectID = "26";  */
"Favorites" = "Favoris";

/*  Class = "NSTextFieldCell"; title = "Name:"; ObjectID = "122";  */
"Name:" = "Nom :";

/*  Class = "NSTextFieldCell"; placeholderString = "[no selection]"; ObjectID = "124";  */
"[no selection]" = "[pas de sélection]";

/*  Class = "NSButtonCell"; title = "Save"; ObjectID = "132";  */
"Save" = "Enregistrer";

/*  Class = "NSMenuItem"; title = "Remove"; ObjectID = "206";  */
"Remove" = "Supprimer";

/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "212";  */
/*  Class = "NSMenuItem"; title = "Duplicate"; ObjectID = "359";  */
"Duplicate" = "Dupliquer";

/*  Class = "NSMenuItem"; gToolTip = "Save query of selected favorite to file"; ObjectID = "365";  */
"Save query of selected favorite to file" = "Enregistrer la requête du favori sélectionné dans un fichier";

/*  Class = "NSMenuItem"; title = "Save Query to File..."; ObjectID = "365";  */
"Save Query to File..." = "Enregistrer la requête dans un fichier...";

/*  Class = "NSMenuItem"; gToolTip = "Remove all favorites"; ObjectID = "367";  */
"Remove all favorites" = "Supprimer tous les favoris";

/*  Class = "NSMenuItem"; title = "Remove All..."; ObjectID = "367";  */
"Remove All..." = "Supprimer tout…";

/*  Class = "NSMenuItem"; title = "Save to File..."; ObjectID = "248";  */
"Save to File..." = "Enregistrer dans un fichier…";

/*  Class = "NSMenuItem"; gToolTip = "Export selected favorites as SPF file"; ObjectID = "361";  */
"Export selected favorites as SPF file" = "Exporter les favoris sélectionnés dans un fichier SPF";

/*  Class = "NSMenuItem"; title = "Export Selected Favorites…"; ObjectID = "361";  */
"Export Selected Favorites…" = "Exporter les favoris sélectionnés...";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and append them to the favorite list"; ObjectID = "363";  */
"Import query favorites from SPF file and append them to the favorite list" = "Importer les favoris d'un fichier SPF et les ajouter à la liste";

/*  Class = "NSMenuItem"; title = "Import Favorites…"; ObjectID = "363";  */
"Import Favorites…" = "Importer les favoris...";

/*  Class = "NSMenuItem"; gToolTip = "Import query favorites from SPF file and replace the current favorites"; ObjectID = "362";  */
"Import query favorites from SPF file and replace the current favorites" = "Importer les favoris d'un fichier SPF et remplacer la liste actuelle";

/*  Class = "NSMenuItem"; title = "Import Favorites by Replacing…"; ObjectID = "362";  */
"Import Favorites by Replacing…" = "Importer les favoris en écrasant...";

/*  Class = "NSButtonCell"; title = "Cancel"; ObjectID = "272";  */
"Cancel" = "Annuler";

/*  Class = "NSTextFieldCell"; title = "Tab Trigger:"; ObjectID = "307";  */
"Tab Trigger:" = "Raccourci+⇥ :";

/*  Class = "NSMenuItem"; title = "Insert Placeholder"; ObjectID = "317";  */
"Insert Placeholder" = "Insérer un paramètre";

/*  Class = "NSMenuItem"; gToolTip = "${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] "; ObjectID = "318";  */
"${1:default_value} – tab key snippet with a definable default value which will be selected\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events] " = "${1:default_value} – Indique l'insert avec valeur par défaut paramétrable qui doit être sélectionné\n\n[“1” peut être un nombre compris entre 0 et 18. Il indique l'ordre d'insertion]";

/*  Class = "NSMenuItem"; title = "Tab Snippet"; ObjectID = "318";  */
"Tab Snippet" = "Point d'insertion";

/*  Class = "NSMenuItem"; gToolTip = "$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] "; ObjectID = "319";  */
"$(shell_command) – shell_command will be executed and inserts its result\n\n[press ⌘. to cancel the execution of “shell_command”]\n [only available inside of tab snippets] " = "$(shell_command) – La commande shell_command va être exécutée et son résultat inséré.\n\n[Appuyer sur ⌘. pour annuler l'exécution de “shell_command”]\n [uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Tab Snippet and Shell Command"; ObjectID = "319";  */
"Tab Snippet and Shell Command" = "Point d'insertion et commande shell";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]"; ObjectID = "321";  */
"$SP_SELECTED_TABLE – will be replaced by the selected table name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLE – sera remplacé par le nom de la table sélectionnée\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Table"; ObjectID = "321";  */
"Name Of Selected Table" = "Nom de la table sélectionnée";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]"; ObjectID = "322";  */
"$SP_SELECTED_TABLES – will be replaced by a comma separated list of all selected table names\n\n[only available inside of tab snippets]" = "$SP_SELECTED_TABLES – sera remplacé par les noms des tables sélectionnées (séparés par des virgules)\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Tables"; ObjectID = "322";  */
"Name Of Selected Tables" = "Noms des tables sélectionnées";

/*  Class = "NSMenuItem"; gToolTip = "$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]"; ObjectID = "323";  */
"$SP_SELECTED_DATABASE – will be replaced by the selected database name\n\n[only available inside of tab snippets]" = "$SP_SELECTED_DATABASE – sera remplacé par le nom de la base de données sélectionnée\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Name Of Selected Database"; ObjectID = "323";  */
"Name Of Selected Database" = "Nom de la base sélectionnée";

/*  Class = "NSMenuItem"; gToolTip = "¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]"; ObjectID = "326";  */
"¦a¦b¦ – such a snippet will be shown as completion list with the items “a” and “b”\n\n[only available inside of tab snippets]" = "¦a¦b¦ – sera remplacé par une liste déroulante avec les éléments \"a\" et \"b\"\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "List Template"; ObjectID = "326";  */
"List Template" = "Liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "327";  */
"¦¦a¦b¦¦ – such a snippet will be shown as completion list with the items “a” and “b” in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦a¦b¦ – sera remplacé par une liste déroulante avec les éléments \"a\" et \"b\" en mode de recherche floue\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "List Template (Fuzzy Search)"; ObjectID = "327";  */
"List Template (Fuzzy Search)" = "Liste (recherche floue)";

/*  Class = "NSMenuItem"; gToolTip = "¦ – list separator\n\n[only available inside of tab snippets]"; ObjectID = "328";  */
"¦ – list separator\n\n[only available inside of tab snippets]" = "¦ – séparateur de liste\n\n[uniquement disponible dans des points d'insertion] – ";

/*  Class = "NSMenuItem"; title = "List Separator"; ObjectID = "328";  */
"List Separator" = "Séparateur de liste";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]"; ObjectID = "329";  */
"¦$SP_ASLIST_ALL_DATABASES¦ – such a snippet will be shown as completion list with all database names from the current connection\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_DATABASES¦ – sera remplacé par une liste déroulante contenant les noms de toutes les bases de données de la connexion courante\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Database Names As List"; ObjectID = "329";  */
"Database Names As List" = "Noms des bases de données sous forme de liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "330";  */
"¦¦$SP_ASLIST_ALL_DATABASES¦¦ – such a snippet will be shown as completion list with all database names from the current connection in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_DATABASES¦ – sera remplacé par une liste déroulante contenant les noms de toutes les bases de données de la connexion courante (en mode de recherche floue) \n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Database Names As List (Fuzzy Search)"; ObjectID = "330";  */
"Database Names As List (Fuzzy Search)" = "Noms des bases de données sous forme de liste (recherche floue)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]"; ObjectID = "332";  */
"¦$SP_ASLIST_ALL_TABLES¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – sera remplacé par une liste déroulante contenant tous les noms des tables (dont les vues) de la base de données sélectionnée\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Table Names As List"; ObjectID = "332";  */
"Table Names As List" = "Noms des tables sous forme de liste";

/*  Class = "NSMenuItem"; gToolTip = "$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] "; ObjectID = "340";  */
"$1 – mirrored tab snippet which is a placeholder for the content of tab snippet “1”\n\n[“1” can be a number from 0 to 18 and defines the order of tab key down events]\n\n[may not be used inside of a tab snippet] " = "$1 – point d'insertion miroir qui représente un texte de remplacement du point d'insertion \"1\"\n\n[\"1\" peut être un nombre compris entre 0 et 18 et qui définit l'ordre du nombre d'appuis sur la touche de tabulation]\n\n[ne devrait pas être utilisé à l'intérieur d'un point d'insertion]";

/*  Class = "NSMenuItem"; title = "Table Names As List (Fuzzy Search)"; ObjectID = "333";  */
"Table Names As List (Fuzzy Search)" = "Noms des tables sous forme de liste (recherche floue)";

/*  Class = "NSMenuItem"; gToolTip = "¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "334";  */
"¦$SP_ASLIST_ALL_FIELDS¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦$SP_ASLIST_ALL_FIELDS¦ – sera remplacé par une liste déroulante contenant tous les noms des champs de la table sélectionnée\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table"; ObjectID = "334";  */
"Field Names As List of Current Table" = "Noms des champs sous forme de liste";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]"; ObjectID = "335";  */
"¦¦$SP_ASLIST_ALL_FIELDS¦¦ – such a snippet will be shown as completion list with all field names from the current selected table\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_FIELDS¦¦ – sera remplacé par une liste déroulante contenant tous les noms des champs de la table sélectionnée (en mode de recherche floue)\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Field Names As List of Current Table (Fuzzy Search)"; ObjectID = "335";  */
"Field Names As List of Current Table (Fuzzy Search)" = "Noms des champs sous forme de liste (recherche floue)";

/*  Class = "NSMenuItem"; title = "Completion Lists:"; ObjectID = "336";  */
"Completion Lists:" = "Listes déroulantes :";

/*  Class = "NSMenuItem"; title = "⇥ Snippet:"; ObjectID = "337";  */
"⇥ Snippet:" = "⇥ Extrait de code :";

/*  Class = "NSMenuItem"; title = "Completion List:"; ObjectID = "338";  */
"Completion List:" = "Liste déroulante :";

/*  Class = "NSMenuItem"; title = "Selection:"; ObjectID = "339";  */
"Selection:" = "Sélection :";

/*  Class = "NSMenuItem"; gToolTip = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]"; ObjectID = "333";  */
"¦¦$SP_ASLIST_ALL_TABLES¦¦ – such a snippet will be shown as completion list with all table names (incl. views) from the current selected database in fuzzy search mode\n\n[only available inside of tab snippets]" = "¦¦$SP_ASLIST_ALL_TABLES¦¦ – sera remplacé par une liste déroulante contenant tous les noms des tables (dont les vues) de la base de données sélectionnée (en mode de recherche floue)\n\n[uniquement disponible dans des points d'insertion]";

/*  Class = "NSMenuItem"; title = "Mirrored Tab Snippet"; ObjectID = "340";  */
"Mirrored Tab Snippet" = "Point d'insertion mirroir";

/*  Class = "NSMenuItem"; title = "Placeholder"; ObjectID = "341";  */
"Placeholder" = "Texte de remplacement";

/*  Class = "NSTextField"; gToolTip = "Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key."; ObjectID = "306";  */
"Alphanumeric character string which inserts the favorite query string after expansion by pressing the ⇥ key." = "Caractères à écrire pour insérer le contenu de la requête favorite après avoir appuyé sur la touche de tabulation (⇥).";

